{
  "name": "GreenGate General Trading P.L.C",
  "description": "Your Trusted Gateway to Global Trade",
  "overview": "At GreenGate General Trading P.L.C., we open doors to seamless global trade. Based in Addis Ababa, we specialize in connecting Ethiopia with the world — sourcing high-quality products directly from China and beyond, and delivering them with reliability, efficiency, and care. With over 8 years of on-the-ground experience in China, our founder brings unique insight into both cultures and markets. Fluent in Chinese and English, GreenGate bridges communication gaps and ensures trustworthy partnerships that deliver real value.   From import and export services to manufacturing and supply solutions, we provide a one-stop gateway for businesses seeking quality, competitive pricing, and sustainable growth. Our focus is simple: to empower clients with smarter sourcing, faster logistics, and lasting business opportunities.  At GreenGate, we don’t just move goods — we build bridges between markets, cultures, and opportunities.",
  "vision": "To become a leading trade and manufacturing gateway between Ethiopia, China, and the world",
  "mission": [
    "At GreenGate, our mission is to simplify global trade for Ethiopian businesses by sourcing quality products, delivering efficient logistics, and fostering trustworthy partnerships. We are committed to bridging Ethiopia and China with integrity, innovation, and care."
    ],
  "goals": [
     "Bridge Global Markets: Strengthen trade ties between Ethiopia, China, and the world by providing reliable import export and manufacturing services."
     "Deliver Quality & Value: Source high-quality products at competitive prices to support our clients’ success." 
     "Empower Local Businesses: Create opportunities for Ethiopian enterprises to grow through access to global supply chains."
     "Foster Trust & Partnerships: Build long-term relationships based on transparency, integrity, and mutual growth."
     "Promote Sustainability: Support eco-friendly and socially responsible practices in trade and manufacturing."
     "Drive Innovation: Continuously adopt smarter solutions in sourcing, logistics, and customer service to stay ahead." 
]
}